Repository: ROLANDsebastien/CoverLetterGenerator
Catalog: LetterGenerator/Resources/*.lproj/Localizable.strings
Languages: fr

# app_title
source: AI Cover Letter Generator
fr: Générateur de Lettre de Motivation IA

# section_context
source: 1. Context
fr: 1. Contexte

# section_job_description
source: 2. Job Description
fr: 2. Description du Poste

# section_signature
source: 4. Signature (Optional)
fr: 4. Signature (Optionnel)

# section_generated_letter
source: Generated Letter
fr: Lettre Générée

# placeholder_drag_drop
source: Drag & Drop your CV PDF here
fr: Glissez-déposez votre CV PDF ici

# status_loaded
source: ✓ Loaded
fr: ✓ Chargé

# label_ai_model
source: AI Model
fr: Modèle IA

# placeholder_custom_instructions
source: Custom Instructions (Tone, Focus...)
fr: Instructions personnalisées (Ton, Focus...)

# placeholder_full_name
source: Full Name
fr: Nom complet

# placeholder_phone
source: Phone
fr: Téléphone

# button_generate
source: Generate Letter
fr: Générer la Lettre

# button_export_pdf
source: Export as PDF
fr: Exporter en PDF

# alert_export_success_title
source: Export Successful
fr: Export Réussi

# alert_export_success_message
source: Your cover letter has been saved successfully.
fr: Votre lettre de motivation a été enregistrée avec succès.

# alert_drop_error_title
source: Drop Error
fr: Erreur de Fichier

# drop_error_only_pdf
source: Only PDF files are supported
fr: Seuls les fichiers PDF sont supportés
